Microchip-MPLAB-Harmony/usb_apps_device/apps/msd_sdcard/firmware/src/packs/ATSAMA5D27CD1G_DFP/component/udphs.h
/* ISOENDPT mode */
#define UDPHS_EPTCTLENB_ISOENDPT_EPT_ENABL_Pos _UINT32_(0)                                          /* (UDPHS_EPTCTLENB) Endpoint Enable Position */
#define UDPHS_EPTCTLENB_ISOENDPT_EPT_ENABL_Msk (_UINT32_(0x1) << UDPHS_EPTCTLENB_ISOENDPT_EPT_ENABL_Pos) /* (UDPHS_EPTCTLENB) Endpoint Enable Mask */
#define UDPHS_EPTCTLENB_ISOENDPT_EPT_ENABL(value) (UDPHS_EPTCTLENB_ISOENDPT_EPT_ENABL_Msk & (_UINT32_(value) << UDPHS_EPTCTLENB_ISOENDPT_EPT_ENABL_Pos))
#define UDPHS_EPTCTLENB_ISOENDPT_AUTO_VALID_Pos _UINT32_(1)                                          /* (UDPHS_EPTCTLENB) Packet Auto-Valid Enable Position */
#define UDPHS_EPTCTLENB_ISOENDPT_AUTO_VALID_Msk (_UINT32_(0x1) << UDPHS_EPTCTLENB_ISOENDPT_AUTO_VALID_Pos) /* (UDPHS_EPTCTLENB) Packet Auto-Valid Enable Mask */
#define UDPHS_EPTCTLENB_ISOENDPT_AUTO_VALID(value) (UDPHS_EPTCTLENB_ISOENDPT_AUTO_VALID_Msk & (_UINT32_(value) << UDPHS_EPTCTLENB_ISOENDPT_AUTO_VALID_Pos))
#define UDPHS_EPTCTLENB_ISOENDPT_INTDIS_DMA_Pos _UINT32_(3)                                          /* (UDPHS_EPTCTLENB) Interrupts Disable DMA Position */
#define UDPHS_EPTCTLENB_ISOENDPT_INTDIS_DMA_Msk (_UINT32_(0x1) << UDPHS_EPTCTLENB_ISOENDPT_INTDIS_DMA_Pos) /* (UDPHS_EPTCTLENB) Interrupts Disable DMA Mask */
#define UDPHS_EPTCTLENB_ISOENDPT_INTDIS_DMA(value) (UDPHS_EPTCTLENB_ISOENDPT_INTDIS_DMA_Msk & (_UINT32_(value) << UDPHS_EPTCTLENB_ISOENDPT_INTDIS_DMA_Pos))
#define UDPHS_EPTCTLENB_ISOENDPT_DATAX_RX_Pos _UINT32_(6)                                          /* (UDPHS_EPTCTLENB) DATAx Interrupt Enable (Only for high bandwidth Isochronous OUT endpoints) Position */
#define UDPHS_EPTCTLENB_ISOENDPT_DATAX_RX_Msk (_UINT32_(0x1) << UDPHS_EPTCTLENB_ISOENDPT_DATAX_RX_Pos) /* (UDPHS_EPTCTLENB) DATAx Interrupt Enable (Only for high bandwidth Isochronous OUT endpoints) Mask */
#define UDPHS_EPTCTLENB_ISOENDPT_DATAX_RX(value) (UDPHS_EPTCTLENB_ISOENDPT_DATAX_RX_Msk & (_UINT32_(value) << UDPHS_EPTCTLENB_ISOENDPT_DATAX_RX_Pos))
#define UDPHS_EPTCTLENB_ISOENDPT_MDATA_RX_Pos _UINT32_(7)                                          /* (UDPHS_EPTCTLENB) MDATA Interrupt Enable (Only for high bandwidth Isochronous OUT endpoints) Position */
#define UDPHS_EPTCTLENB_ISOENDPT_MDATA_RX_Msk (_UINT32_(0x1) << UDPHS_EPTCTLENB_ISOENDPT_MDATA_RX_Pos) /* (UDPHS_EPTCTLENB) MDATA Interrupt Enable (Only for high bandwidth Isochronous OUT endpoints) Mask */
#define UDPHS_EPTCTLENB_ISOENDPT_MDATA_RX(value) (UDPHS_EPTCTLENB_ISOENDPT_MDATA_RX_Msk & (_UINT32_(value) << UDPHS_EPTCTLENB_ISOENDPT_MDATA_RX_Pos))
#define UDPHS_EPTCTLENB_ISOENDPT_ERR_OVFLW_Pos _UINT32_(8)                                          /* (UDPHS_EPTCTLENB) Overflow Error Interrupt Enable Position */
#define UDPHS_EPTCTLENB_ISOENDPT_ERR_OVFLW_Msk (_UINT32_(0x1) << UDPHS_EPTCTLENB_ISOENDPT_ERR_OVFLW_Pos) /* (UDPHS_EPTCTLENB) Overflow Error Interrupt Enable Mask */
#define UDPHS_EPTCTLENB_ISOENDPT_ERR_OVFLW(value) (UDPHS_EPTCTLENB_ISOENDPT_ERR_OVFLW_Msk & (_UINT32_(value) << UDPHS_EPTCTLENB_ISOENDPT_ERR_OVFLW_Pos))
#define UDPHS_EPTCTLENB_ISOENDPT_RXRDY_TXKL_Pos _UINT32_(9)                                          /* (UDPHS_EPTCTLENB) Received OUT Data Interrupt Enable Position */
#define UDPHS_EPTCTLENB_ISOENDPT_RXRDY_TXKL_Msk (_UINT32_(0x1) << UDPHS_EPTCTLENB_ISOENDPT_RXRDY_TXKL_Pos) /* (UDPHS_EPTCTLENB) Received OUT Data Interrupt Enable Mask */
#define UDPHS_EPTCTLENB_ISOENDPT_RXRDY_TXKL(value) (UDPHS_EPTCTLENB_ISOENDPT_RXRDY_TXKL_Msk & (_UINT32_(value) << UDPHS_EPTCTLENB_ISOENDPT_RXRDY_TXKL_Pos))
#define UDPHS_EPTCTLENB_ISOENDPT_TX_COMPLT_Pos _UINT32_(10)                                         /* (UDPHS_EPTCTLENB) Transmitted IN Data Complete Interrupt Enable Position */
#define UDPHS_EPTCTLENB_ISOENDPT_TX_COMPLT_Msk (_UINT32_(0x1) << UDPHS_EPTCTLENB_ISOENDPT_TX_COMPLT_Pos) /* (UDPHS_EPTCTLENB) Transmitted IN Data Complete Interrupt Enable Mask */
#define UDPHS_EPTCTLENB_ISOENDPT_TX_COMPLT(value) (UDPHS_EPTCTLENB_ISOENDPT_TX_COMPLT_Msk & (_UINT32_(value) << UDPHS_EPTCTLENB_ISOENDPT_TX_COMPLT_Pos))
#define UDPHS_EPTCTLENB_ISOENDPT_TXRDY_TRER_Pos _UINT32_(11)                                         /* (UDPHS_EPTCTLENB) TX Packet Ready/Transaction Error Interrupt Enable Position */
#define UDPHS_EPTCTLENB_ISOENDPT_TXRDY_TRER_Msk (_UINT32_(0x1) << UDPHS_EPTCTLENB_ISOENDPT_TXRDY_TRER_Pos) /* (UDPHS_EPTCTLENB) TX Packet Ready/Transaction Error Interrupt Enable Mask */
#define UDPHS_EPTCTLENB_ISOENDPT_TXRDY_TRER(value) (UDPHS_EPTCTLENB_ISOENDPT_TXRDY_TRER_Msk & (_UINT32_(value) << UDPHS_EPTCTLENB_ISOENDPT_TXRDY_TRER_Pos))
#define UDPHS_EPTCTLENB_ISOENDPT_ERR_FL_ISO_Pos _UINT32_(12)                                         /* (UDPHS_EPTCTLENB) Error Flow Interrupt Enable Position */
#define UDPHS_EPTCTLENB_ISOENDPT_ERR_FL_ISO_Msk (_UINT32_(0x1) << UDPHS_EPTCTLENB_ISOENDPT_ERR_FL_ISO_Pos) /* (UDPHS_EPTCTLENB) Error Flow Interrupt Enable Mask */
#define UDPHS_EPTCTLENB_ISOENDPT_ERR_FL_ISO(value) (UDPHS_EPTCTLENB_ISOENDPT_ERR_FL_ISO_Msk & (_UINT32_(value) << UDPHS_EPTCTLENB_ISOENDPT_ERR_FL_ISO_Pos))
#define UDPHS_EPTCTLENB_ISOENDPT_ERR_CRC_NTR_Pos _UINT32_(13)                                         /* (UDPHS_EPTCTLENB) ISO CRC Error/Number of Transaction Error Interrupt Enable Position */
#define UDPHS_EPTCTLENB_ISOENDPT_ERR_CRC_NTR_Msk (_UINT32_(0x1) << UDPHS_EPTCTLENB_ISOENDPT_ERR_CRC_NTR_Pos) /* (UDPHS_EPTCTLENB) ISO CRC Error/Number of Transaction Error Interrupt Enable Mask */
#define UDPHS_EPTCTLENB_ISOENDPT_ERR_CRC_NTR(value) (UDPHS_EPTCTLENB_ISOENDPT_ERR_CRC_NTR_Msk & (_UINT32_(value) << UDPHS_EPTCTLENB_ISOENDPT_ERR_CRC_NTR_Pos))
#define UDPHS_EPTCTLENB_ISOENDPT_ERR_FLUSH_Pos _UINT32_(14)                                         /* (UDPHS_EPTCTLENB) Bank Flush Error Interrupt Enable Position */
#define UDPHS_EPTCTLENB_ISOENDPT_ERR_FLUSH_Msk (_UINT32_(0x1) << UDPHS_EPTCTLENB_ISOENDPT_ERR_FLUSH_Pos) /* (UDPHS_EPTCTLENB) Bank Flush Error Interrupt Enable Mask */
#define UDPHS_EPTCTLENB_ISOENDPT_ERR_FLUSH(value) (UDPHS_EPTCTLENB_ISOENDPT_ERR_FLUSH_Msk & (_UINT32_(value) << UDPHS_EPTCTLENB_ISOENDPT_ERR_FLUSH_Pos))
#define UDPHS_EPTCTLENB_ISOENDPT_BUSY_BANK_Pos _UINT32_(18)                                         /* (UDPHS_EPTCTLENB) Busy Bank Interrupt Enable Position */
#define UDPHS_EPTCTLENB_ISOENDPT_BUSY_BANK_Msk (_UINT32_(0x1) << UDPHS_EPTCTLENB_ISOENDPT_BUSY_BANK_Pos) /* (UDPHS_EPTCTLENB) Busy Bank Interrupt Enable Mask */
#define UDPHS_EPTCTLENB_ISOENDPT_BUSY_BANK(value) (UDPHS_EPTCTLENB_ISOENDPT_BUSY_BANK_Msk & (_UINT32_(value) << UDPHS_EPTCTLENB_ISOENDPT_BUSY_BANK_Pos))
#define UDPHS_EPTCTLENB_ISOENDPT_SHRT_PCKT_Pos _UINT32_(31)                                         /* (UDPHS_EPTCTLENB) Short Packet Send/Short Packet Interrupt Enable Position */
#define UDPHS_EPTCTLENB_ISOENDPT_SHRT_PCKT_Msk (_UINT32_(0x1) << UDPHS_EPTCTLENB_ISOENDPT_SHRT_PCKT_Pos) /* (UDPHS_EPTCTLENB) Short Packet Send/Short Packet Interrupt Enable Mask */
#define UDPHS_EPTCTLENB_ISOENDPT_SHRT_PCKT(value) (UDPHS_EPTCTLENB_ISOENDPT_SHRT_PCKT_Msk & (_UINT32_(value) << UDPHS_EPTCTLENB_ISOENDPT_SHRT_PCKT_Pos))
#define UDPHS_EPTCTLENB_ISOENDPT_Msk          _UINT32_(0x80047FCB)                                  /* (UDPHS_EPTCTLENB_ISOENDPT) Register Mask  */


/* -------- UDPHS_EPTCTLDIS : (UDPHS Offset: 0x08) ( /W 32) UDPHS Endpoint Control Disable Register (endpoint = 0) -------- */
#define UDPHS_EPTCTLDIS_EPT_DISABL_Pos        _UINT32_(0)                                          /* (UDPHS_EPTCTLDIS) Endpoint Disable Position */
#define UDPHS_EPTCTLDIS_EPT_DISABL_Msk        (_UINT32_(0x1) << UDPHS_EPTCTLDIS_EPT_DISABL_Pos)    /* (UDPHS_EPTCTLDIS) Endpoint Disable Mask */
#define UDPHS_EPTCTLDIS_EPT_DISABL(value)     (UDPHS_EPTCTLDIS_EPT_DISABL_Msk & (_UINT32_(value) << UDPHS_EPTCTLDIS_EPT_DISABL_Pos)) /* Assigment of value for EPT_DISABL in the UDPHS_EPTCTLDIS register */
#define UDPHS_EPTCTLDIS_AUTO_VALID_Pos        _UINT32_(1)                                          /* (UDPHS_EPTCTLDIS) Packet Auto-Valid Disable Position */
#define UDPHS_EPTCTLDIS_AUTO_VALID_Msk        (_UINT32_(0x1) << UDPHS_EPTCTLDIS_AUTO_VALID_Pos)    /* (UDPHS_EPTCTLDIS) Packet Auto-Valid Disable Mask */
#define UDPHS_EPTCTLDIS_AUTO_VALID(value)     (UDPHS_EPTCTLDIS_AUTO_VALID_Msk & (_UINT32_(value) << UDPHS_EPTCTLDIS_AUTO_VALID_Pos)) /* Assigment of value for AUTO_VALID in the UDPHS_EPTCTLDIS register */
#define UDPHS_EPTCTLDIS_INTDIS_DMA_Pos        _UINT32_(3)                                          /* (UDPHS_EPTCTLDIS) Interrupts Disable DMA Position */
#define UDPHS_EPTCTLDIS_INTDIS_DMA_Msk        (_UINT32_(0x1) << UDPHS_EPTCTLDIS_INTDIS_DMA_Pos)    /* (UDPHS_EPTCTLDIS) Interrupts Disable DMA Mask */
#define UDPHS_EPTCTLDIS_INTDIS_DMA(value)     (UDPHS_EPTCTLDIS_INTDIS_DMA_Msk & (_UINT32_(value) << UDPHS_EPTCTLDIS_INTDIS_DMA_Pos)) /* Assigment of value for INTDIS_DMA in the UDPHS_EPTCTLDIS register */
#define UDPHS_EPTCTLDIS_NYET_DIS_Pos          _UINT32_(4)                                          /* (UDPHS_EPTCTLDIS) NYET Enable (Only for High Speed Bulk OUT endpoints) Position */
#define UDPHS_EPTCTLDIS_NYET_DIS_Msk          (_UINT32_(0x1) << UDPHS_EPTCTLDIS_NYET_DIS_Pos)      /* (UDPHS_EPTCTLDIS) NYET Enable (Only for High Speed Bulk OUT endpoints) Mask */
#define UDPHS_EPTCTLDIS_NYET_DIS(value)       (UDPHS_EPTCTLDIS_NYET_DIS_Msk & (_UINT32_(value) << UDPHS_EPTCTLDIS_NYET_DIS_Pos)) /* Assigment of value for NYET_DIS in the UDPHS_EPTCTLDIS register */
#define UDPHS_EPTCTLDIS_ERR_OVFLW_Pos         _UINT32_(8)                                          /* (UDPHS_EPTCTLDIS) Overflow Error Interrupt Disable Position */
#define UDPHS_EPTCTLDIS_ERR_OVFLW_Msk         (_UINT32_(0x1) << UDPHS_EPTCTLDIS_ERR_OVFLW_Pos)     /* (UDPHS_EPTCTLDIS) Overflow Error Interrupt Disable Mask */
#define UDPHS_EPTCTLDIS_ERR_OVFLW(value)      (UDPHS_EPTCTLDIS_ERR_OVFLW_Msk & (_UINT32_(value) << UDPHS_EPTCTLDIS_ERR_OVFLW_Pos)) /* Assigment of value for ERR_OVFLW in the UDPHS_EPTCTLDIS register */
#define UDPHS_EPTCTLDIS_RXRDY_TXKL_Pos        _UINT32_(9)                                          /* (UDPHS_EPTCTLDIS) Received OUT Data Interrupt Disable Position */
#define UDPHS_EPTCTLDIS_RXRDY_TXKL_Msk        (_UINT32_(0x1) << UDPHS_EPTCTLDIS_RXRDY_TXKL_Pos)    /* (UDPHS_EPTCTLDIS) Received OUT Data Interrupt Disable Mask */
#define UDPHS_EPTCTLDIS_RXRDY_TXKL(value)     (UDPHS_EPTCTLDIS_RXRDY_TXKL_Msk & (_UINT32_(value) << UDPHS_EPTCTLDIS_RXRDY_TXKL_Pos)) /* Assigment of value for RXRDY_TXKL in the UDPHS_EPTCTLDIS register */
#define UDPHS_EPTCTLDIS_TX_COMPLT_Pos         _UINT32_(10)                                         /* (UDPHS_EPTCTLDIS) Transmitted IN Data Complete Interrupt Disable Position */
#define UDPHS_EPTCTLDIS_TX_COMPLT_Msk         (_UINT32_(0x1) << UDPHS_EPTCTLDIS_TX_COMPLT_Pos)     /* (UDPHS_EPTCTLDIS) Transmitted IN Data Complete Interrupt Disable Mask */
#define UDPHS_EPTCTLDIS_TX_COMPLT(value)      (UDPHS_EPTCTLDIS_TX_COMPLT_Msk & (_UINT32_(value) << UDPHS_EPTCTLDIS_TX_COMPLT_Pos)) /* Assigment of value for TX_COMPLT in the UDPHS_EPTCTLDIS register */
#define UDPHS_EPTCTLDIS_TXRDY_Pos             _UINT32_(11)                                         /* (UDPHS_EPTCTLDIS) TX Packet Ready Interrupt Disable Position */
#define UDPHS_EPTCTLDIS_TXRDY_Msk             (_UINT32_(0x1) << UDPHS_EPTCTLDIS_TXRDY_Pos)         /* (UDPHS_EPTCTLDIS) TX Packet Ready Interrupt Disable Mask */
#define UDPHS_EPTCTLDIS_TXRDY(value)          (UDPHS_EPTCTLDIS_TXRDY_Msk & (_UINT32_(value) << UDPHS_EPTCTLDIS_TXRDY_Pos)) /* Assigment of value for TXRDY in the UDPHS_EPTCTLDIS register */
#define UDPHS_EPTCTLDIS_RX_SETUP_Pos          _UINT32_(12)                                         /* (UDPHS_EPTCTLDIS) Received SETUP Interrupt Disable Position */
#define UDPHS_EPTCTLDIS_RX_SETUP_Msk          (_UINT32_(0x1) << UDPHS_EPTCTLDIS_RX_SETUP_Pos)      /* (UDPHS_EPTCTLDIS) Received SETUP Interrupt Disable Mask */
#define UDPHS_EPTCTLDIS_RX_SETUP(value)       (UDPHS_EPTCTLDIS_RX_SETUP_Msk & (_UINT32_(value) << UDPHS_EPTCTLDIS_RX_SETUP_Pos)) /* Assigment of value for RX_SETUP in the UDPHS_EPTCTLDIS register */
#define UDPHS_EPTCTLDIS_STALL_SNT_Pos         _UINT32_(13)                                         /* (UDPHS_EPTCTLDIS) Stall Sent Interrupt Disable Position */
#define UDPHS_EPTCTLDIS_STALL_SNT_Msk         (_UINT32_(0x1) << UDPHS_EPTCTLDIS_STALL_SNT_Pos)     /* (UDPHS_EPTCTLDIS) Stall Sent Interrupt Disable Mask */
#define UDPHS_EPTCTLDIS_STALL_SNT(value)      (UDPHS_EPTCTLDIS_STALL_SNT_Msk & (_UINT32_(value) << UDPHS_EPTCTLDIS_STALL_SNT_Pos)) /* Assigment of value for STALL_SNT in the UDPHS_EPTCTLDIS register */
#define UDPHS_EPTCTLDIS_NAK_IN_Pos            _UINT32_(14)                                         /* (UDPHS_EPTCTLDIS) NAKIN Interrupt Disable Position */
#define UDPHS_EPTCTLDIS_NAK_IN_Msk            (_UINT32_(0x1) << UDPHS_EPTCTLDIS_NAK_IN_Pos)        /* (UDPHS_EPTCTLDIS) NAKIN Interrupt Disable Mask */
#define UDPHS_EPTCTLDIS_NAK_IN(value)         (UDPHS_EPTCTLDIS_NAK_IN_Msk & (_UINT32_(value) << UDPHS_EPTCTLDIS_NAK_IN_Pos)) /* Assigment of value for NAK_IN in the UDPHS_EPTCTLDIS register */
#define UDPHS_EPTCTLDIS_NAK_OUT_Pos           _UINT32_(15)                                         /* (UDPHS_EPTCTLDIS) NAKOUT Interrupt Disable Position */
#define UDPHS_EPTCTLDIS_NAK_OUT_Msk           (_UINT32_(0x1) << UDPHS_EPTCTLDIS_NAK_OUT_Pos)       /* (UDPHS_EPTCTLDIS) NAKOUT Interrupt Disable Mask */
#define UDPHS_EPTCTLDIS_NAK_OUT(value)        (UDPHS_EPTCTLDIS_NAK_OUT_Msk & (_UINT32_(value) << UDPHS_EPTCTLDIS_NAK_OUT_Pos)) /* Assigment of value for NAK_OUT in the UDPHS_EPTCTLDIS register */
#define UDPHS_EPTCTLDIS_BUSY_BANK_Pos         _UINT32_(18)                                         /* (UDPHS_EPTCTLDIS) Busy Bank Interrupt Disable Position */
#define UDPHS_EPTCTLDIS_BUSY_BANK_Msk         (_UINT32_(0x1) << UDPHS_EPTCTLDIS_BUSY_BANK_Pos)     /* (UDPHS_EPTCTLDIS) Busy Bank Interrupt Disable Mask */
#define UDPHS_EPTCTLDIS_BUSY_BANK(value)      (UDPHS_EPTCTLDIS_BUSY_BANK_Msk & (_UINT32_(value) << UDPHS_EPTCTLDIS_BUSY_BANK_Pos)) /* Assigment of value for BUSY_BANK in the UDPHS_EPTCTLDIS register */
#define UDPHS_EPTCTLDIS_SHRT_PCKT_Pos         _UINT32_(31)                                         /* (UDPHS_EPTCTLDIS) Short Packet Interrupt Disable Position */
#define UDPHS_EPTCTLDIS_SHRT_PCKT_Msk         (_UINT32_(0x1) << UDPHS_EPTCTLDIS_SHRT_PCKT_Pos)     /* (UDPHS_EPTCTLDIS) Short Packet Interrupt Disable Mask */
#define UDPHS_EPTCTLDIS_SHRT_PCKT(value)      (UDPHS_EPTCTLDIS_SHRT_PCKT_Msk & (_UINT32_(value) << UDPHS_EPTCTLDIS_SHRT_PCKT_Pos)) /* Assigment of value for SHRT_PCKT in the UDPHS_EPTCTLDIS register */
#define UDPHS_EPTCTLDIS_Msk                   _UINT32_(0x8004FF1B)                                 /* (UDPHS_EPTCTLDIS) Register Mask  */

