Microchip-MPLAB-Harmony/usb_apps_device/apps/msd_sdcard/firmware/src/packs/ATSAMA5D27CD1G_DFP/component/udphs.h
/* -------- UDPHS_CLRINT : (UDPHS Offset: 0x18) ( /W 32) UDPHS Clear Interrupt Register -------- */
#define UDPHS_CLRINT_DET_SUSPD_Pos            _UINT32_(1)                                          /* (UDPHS_CLRINT) Suspend Interrupt Clear Position */
#define UDPHS_CLRINT_DET_SUSPD_Msk            (_UINT32_(0x1) << UDPHS_CLRINT_DET_SUSPD_Pos)        /* (UDPHS_CLRINT) Suspend Interrupt Clear Mask */
#define UDPHS_CLRINT_DET_SUSPD(value)         (UDPHS_CLRINT_DET_SUSPD_Msk & (_UINT32_(value) << UDPHS_CLRINT_DET_SUSPD_Pos)) /* Assigment of value for DET_SUSPD in the UDPHS_CLRINT register */
#define UDPHS_CLRINT_MICRO_SOF_Pos            _UINT32_(2)                                          /* (UDPHS_CLRINT) Micro Start Of Frame Interrupt Clear Position */
#define UDPHS_CLRINT_MICRO_SOF_Msk            (_UINT32_(0x1) << UDPHS_CLRINT_MICRO_SOF_Pos)        /* (UDPHS_CLRINT) Micro Start Of Frame Interrupt Clear Mask */
#define UDPHS_CLRINT_MICRO_SOF(value)         (UDPHS_CLRINT_MICRO_SOF_Msk & (_UINT32_(value) << UDPHS_CLRINT_MICRO_SOF_Pos)) /* Assigment of value for MICRO_SOF in the UDPHS_CLRINT register */
#define UDPHS_CLRINT_INT_SOF_Pos              _UINT32_(3)                                          /* (UDPHS_CLRINT) Start Of Frame Interrupt Clear Position */
#define UDPHS_CLRINT_INT_SOF_Msk              (_UINT32_(0x1) << UDPHS_CLRINT_INT_SOF_Pos)          /* (UDPHS_CLRINT) Start Of Frame Interrupt Clear Mask */
#define UDPHS_CLRINT_INT_SOF(value)           (UDPHS_CLRINT_INT_SOF_Msk & (_UINT32_(value) << UDPHS_CLRINT_INT_SOF_Pos)) /* Assigment of value for INT_SOF in the UDPHS_CLRINT register */
#define UDPHS_CLRINT_ENDRESET_Pos             _UINT32_(4)                                          /* (UDPHS_CLRINT) End Of Reset Interrupt Clear Position */
#define UDPHS_CLRINT_ENDRESET_Msk             (_UINT32_(0x1) << UDPHS_CLRINT_ENDRESET_Pos)         /* (UDPHS_CLRINT) End Of Reset Interrupt Clear Mask */
#define UDPHS_CLRINT_ENDRESET(value)          (UDPHS_CLRINT_ENDRESET_Msk & (_UINT32_(value) << UDPHS_CLRINT_ENDRESET_Pos)) /* Assigment of value for ENDRESET in the UDPHS_CLRINT register */
#define UDPHS_CLRINT_WAKE_UP_Pos              _UINT32_(5)                                          /* (UDPHS_CLRINT) Wake Up CPU Interrupt Clear Position */
#define UDPHS_CLRINT_WAKE_UP_Msk              (_UINT32_(0x1) << UDPHS_CLRINT_WAKE_UP_Pos)          /* (UDPHS_CLRINT) Wake Up CPU Interrupt Clear Mask */
#define UDPHS_CLRINT_WAKE_UP(value)           (UDPHS_CLRINT_WAKE_UP_Msk & (_UINT32_(value) << UDPHS_CLRINT_WAKE_UP_Pos)) /* Assigment of value for WAKE_UP in the UDPHS_CLRINT register */
#define UDPHS_CLRINT_ENDOFRSM_Pos             _UINT32_(6)                                          /* (UDPHS_CLRINT) End Of Resume Interrupt Clear Position */
#define UDPHS_CLRINT_ENDOFRSM_Msk             (_UINT32_(0x1) << UDPHS_CLRINT_ENDOFRSM_Pos)         /* (UDPHS_CLRINT) End Of Resume Interrupt Clear Mask */
#define UDPHS_CLRINT_ENDOFRSM(value)          (UDPHS_CLRINT_ENDOFRSM_Msk & (_UINT32_(value) << UDPHS_CLRINT_ENDOFRSM_Pos)) /* Assigment of value for ENDOFRSM in the UDPHS_CLRINT register */
#define UDPHS_CLRINT_UPSTR_RES_Pos            _UINT32_(7)                                          /* (UDPHS_CLRINT) Upstream Resume Interrupt Clear Position */
#define UDPHS_CLRINT_UPSTR_RES_Msk            (_UINT32_(0x1) << UDPHS_CLRINT_UPSTR_RES_Pos)        /* (UDPHS_CLRINT) Upstream Resume Interrupt Clear Mask */
#define UDPHS_CLRINT_UPSTR_RES(value)         (UDPHS_CLRINT_UPSTR_RES_Msk & (_UINT32_(value) << UDPHS_CLRINT_UPSTR_RES_Pos)) /* Assigment of value for UPSTR_RES in the UDPHS_CLRINT register */
#define UDPHS_CLRINT_Msk                      _UINT32_(0x000000FE)                                 /* (UDPHS_CLRINT) Register Mask  */


/* -------- UDPHS_EPTRST : (UDPHS Offset: 0x1C) ( /W 32) UDPHS Endpoints Reset Register -------- */
#define UDPHS_EPTRST_EPT_0_Pos                _UINT32_(0)                                          /* (UDPHS_EPTRST) Endpoint 0 Reset Position */
#define UDPHS_EPTRST_EPT_0_Msk                (_UINT32_(0x1) << UDPHS_EPTRST_EPT_0_Pos)            /* (UDPHS_EPTRST) Endpoint 0 Reset Mask */
#define UDPHS_EPTRST_EPT_0(value)             (UDPHS_EPTRST_EPT_0_Msk & (_UINT32_(value) << UDPHS_EPTRST_EPT_0_Pos)) /* Assigment of value for EPT_0 in the UDPHS_EPTRST register */
#define UDPHS_EPTRST_EPT_1_Pos                _UINT32_(1)                                          /* (UDPHS_EPTRST) Endpoint 1 Reset Position */
#define UDPHS_EPTRST_EPT_1_Msk                (_UINT32_(0x1) << UDPHS_EPTRST_EPT_1_Pos)            /* (UDPHS_EPTRST) Endpoint 1 Reset Mask */
#define UDPHS_EPTRST_EPT_1(value)             (UDPHS_EPTRST_EPT_1_Msk & (_UINT32_(value) << UDPHS_EPTRST_EPT_1_Pos)) /* Assigment of value for EPT_1 in the UDPHS_EPTRST register */
#define UDPHS_EPTRST_EPT_2_Pos                _UINT32_(2)                                          /* (UDPHS_EPTRST) Endpoint 2 Reset Position */
#define UDPHS_EPTRST_EPT_2_Msk                (_UINT32_(0x1) << UDPHS_EPTRST_EPT_2_Pos)            /* (UDPHS_EPTRST) Endpoint 2 Reset Mask */
#define UDPHS_EPTRST_EPT_2(value)             (UDPHS_EPTRST_EPT_2_Msk & (_UINT32_(value) << UDPHS_EPTRST_EPT_2_Pos)) /* Assigment of value for EPT_2 in the UDPHS_EPTRST register */
#define UDPHS_EPTRST_EPT_3_Pos                _UINT32_(3)                                          /* (UDPHS_EPTRST) Endpoint 3 Reset Position */
#define UDPHS_EPTRST_EPT_3_Msk                (_UINT32_(0x1) << UDPHS_EPTRST_EPT_3_Pos)            /* (UDPHS_EPTRST) Endpoint 3 Reset Mask */
#define UDPHS_EPTRST_EPT_3(value)             (UDPHS_EPTRST_EPT_3_Msk & (_UINT32_(value) << UDPHS_EPTRST_EPT_3_Pos)) /* Assigment of value for EPT_3 in the UDPHS_EPTRST register */
#define UDPHS_EPTRST_EPT_4_Pos                _UINT32_(4)                                          /* (UDPHS_EPTRST) Endpoint 4 Reset Position */
#define UDPHS_EPTRST_EPT_4_Msk                (_UINT32_(0x1) << UDPHS_EPTRST_EPT_4_Pos)            /* (UDPHS_EPTRST) Endpoint 4 Reset Mask */
#define UDPHS_EPTRST_EPT_4(value)             (UDPHS_EPTRST_EPT_4_Msk & (_UINT32_(value) << UDPHS_EPTRST_EPT_4_Pos)) /* Assigment of value for EPT_4 in the UDPHS_EPTRST register */
#define UDPHS_EPTRST_EPT_5_Pos                _UINT32_(5)                                          /* (UDPHS_EPTRST) Endpoint 5 Reset Position */
#define UDPHS_EPTRST_EPT_5_Msk                (_UINT32_(0x1) << UDPHS_EPTRST_EPT_5_Pos)            /* (UDPHS_EPTRST) Endpoint 5 Reset Mask */
#define UDPHS_EPTRST_EPT_5(value)             (UDPHS_EPTRST_EPT_5_Msk & (_UINT32_(value) << UDPHS_EPTRST_EPT_5_Pos)) /* Assigment of value for EPT_5 in the UDPHS_EPTRST register */
#define UDPHS_EPTRST_EPT_6_Pos                _UINT32_(6)                                          /* (UDPHS_EPTRST) Endpoint 6 Reset Position */
#define UDPHS_EPTRST_EPT_6_Msk                (_UINT32_(0x1) << UDPHS_EPTRST_EPT_6_Pos)            /* (UDPHS_EPTRST) Endpoint 6 Reset Mask */
#define UDPHS_EPTRST_EPT_6(value)             (UDPHS_EPTRST_EPT_6_Msk & (_UINT32_(value) << UDPHS_EPTRST_EPT_6_Pos)) /* Assigment of value for EPT_6 in the UDPHS_EPTRST register */
#define UDPHS_EPTRST_EPT_7_Pos                _UINT32_(7)                                          /* (UDPHS_EPTRST) Endpoint 7 Reset Position */
#define UDPHS_EPTRST_EPT_7_Msk                (_UINT32_(0x1) << UDPHS_EPTRST_EPT_7_Pos)            /* (UDPHS_EPTRST) Endpoint 7 Reset Mask */
#define UDPHS_EPTRST_EPT_7(value)             (UDPHS_EPTRST_EPT_7_Msk & (_UINT32_(value) << UDPHS_EPTRST_EPT_7_Pos)) /* Assigment of value for EPT_7 in the UDPHS_EPTRST register */
#define UDPHS_EPTRST_EPT_8_Pos                _UINT32_(8)                                          /* (UDPHS_EPTRST) Endpoint 8 Reset Position */
#define UDPHS_EPTRST_EPT_8_Msk                (_UINT32_(0x1) << UDPHS_EPTRST_EPT_8_Pos)            /* (UDPHS_EPTRST) Endpoint 8 Reset Mask */
#define UDPHS_EPTRST_EPT_8(value)             (UDPHS_EPTRST_EPT_8_Msk & (_UINT32_(value) << UDPHS_EPTRST_EPT_8_Pos)) /* Assigment of value for EPT_8 in the UDPHS_EPTRST register */
#define UDPHS_EPTRST_EPT_9_Pos                _UINT32_(9)                                          /* (UDPHS_EPTRST) Endpoint 9 Reset Position */
#define UDPHS_EPTRST_EPT_9_Msk                (_UINT32_(0x1) << UDPHS_EPTRST_EPT_9_Pos)            /* (UDPHS_EPTRST) Endpoint 9 Reset Mask */
#define UDPHS_EPTRST_EPT_9(value)             (UDPHS_EPTRST_EPT_9_Msk & (_UINT32_(value) << UDPHS_EPTRST_EPT_9_Pos)) /* Assigment of value for EPT_9 in the UDPHS_EPTRST register */
#define UDPHS_EPTRST_EPT_10_Pos               _UINT32_(10)                                         /* (UDPHS_EPTRST) Endpoint 10 Reset Position */
#define UDPHS_EPTRST_EPT_10_Msk               (_UINT32_(0x1) << UDPHS_EPTRST_EPT_10_Pos)           /* (UDPHS_EPTRST) Endpoint 10 Reset Mask */
#define UDPHS_EPTRST_EPT_10(value)            (UDPHS_EPTRST_EPT_10_Msk & (_UINT32_(value) << UDPHS_EPTRST_EPT_10_Pos)) /* Assigment of value for EPT_10 in the UDPHS_EPTRST register */
#define UDPHS_EPTRST_EPT_11_Pos               _UINT32_(11)                                         /* (UDPHS_EPTRST) Endpoint 11 Reset Position */
#define UDPHS_EPTRST_EPT_11_Msk               (_UINT32_(0x1) << UDPHS_EPTRST_EPT_11_Pos)           /* (UDPHS_EPTRST) Endpoint 11 Reset Mask */
#define UDPHS_EPTRST_EPT_11(value)            (UDPHS_EPTRST_EPT_11_Msk & (_UINT32_(value) << UDPHS_EPTRST_EPT_11_Pos)) /* Assigment of value for EPT_11 in the UDPHS_EPTRST register */
#define UDPHS_EPTRST_EPT_12_Pos               _UINT32_(12)                                         /* (UDPHS_EPTRST) Endpoint 12 Reset Position */
#define UDPHS_EPTRST_EPT_12_Msk               (_UINT32_(0x1) << UDPHS_EPTRST_EPT_12_Pos)           /* (UDPHS_EPTRST) Endpoint 12 Reset Mask */
#define UDPHS_EPTRST_EPT_12(value)            (UDPHS_EPTRST_EPT_12_Msk & (_UINT32_(value) << UDPHS_EPTRST_EPT_12_Pos)) /* Assigment of value for EPT_12 in the UDPHS_EPTRST register */
#define UDPHS_EPTRST_EPT_13_Pos               _UINT32_(13)                                         /* (UDPHS_EPTRST) Endpoint 13 Reset Position */
#define UDPHS_EPTRST_EPT_13_Msk               (_UINT32_(0x1) << UDPHS_EPTRST_EPT_13_Pos)           /* (UDPHS_EPTRST) Endpoint 13 Reset Mask */
#define UDPHS_EPTRST_EPT_13(value)            (UDPHS_EPTRST_EPT_13_Msk & (_UINT32_(value) << UDPHS_EPTRST_EPT_13_Pos)) /* Assigment of value for EPT_13 in the UDPHS_EPTRST register */
#define UDPHS_EPTRST_EPT_14_Pos               _UINT32_(14)                                         /* (UDPHS_EPTRST) Endpoint 14 Reset Position */
#define UDPHS_EPTRST_EPT_14_Msk               (_UINT32_(0x1) << UDPHS_EPTRST_EPT_14_Pos)           /* (UDPHS_EPTRST) Endpoint 14 Reset Mask */
#define UDPHS_EPTRST_EPT_14(value)            (UDPHS_EPTRST_EPT_14_Msk & (_UINT32_(value) << UDPHS_EPTRST_EPT_14_Pos)) /* Assigment of value for EPT_14 in the UDPHS_EPTRST register */
#define UDPHS_EPTRST_EPT_15_Pos               _UINT32_(15)                                         /* (UDPHS_EPTRST) Endpoint 15 Reset Position */
#define UDPHS_EPTRST_EPT_15_Msk               (_UINT32_(0x1) << UDPHS_EPTRST_EPT_15_Pos)           /* (UDPHS_EPTRST) Endpoint 15 Reset Mask */
#define UDPHS_EPTRST_EPT_15(value)            (UDPHS_EPTRST_EPT_15_Msk & (_UINT32_(value) << UDPHS_EPTRST_EPT_15_Pos)) /* Assigment of value for EPT_15 in the UDPHS_EPTRST register */
#define UDPHS_EPTRST_Msk                      _UINT32_(0x0000FFFF)                                 /* (UDPHS_EPTRST) Register Mask  */

#define UDPHS_EPTRST_EPT__Pos                 _UINT32_(0)                                          /* (UDPHS_EPTRST Position) Endpoint x5 Reset */
#define UDPHS_EPTRST_EPT__Msk                 (_UINT32_(0xFFFF) << UDPHS_EPTRST_EPT__Pos)          /* (UDPHS_EPTRST Mask) EPT_ */
#define UDPHS_EPTRST_EPT_(value)              (UDPHS_EPTRST_EPT__Msk & (_UINT32_(value) << UDPHS_EPTRST_EPT__Pos)) 

/* -------- UDPHS_TST : (UDPHS Offset: 0xE0) (R/W 32) UDPHS Test Register -------- */
#define UDPHS_TST_SPEED_CFG_Pos               _UINT32_(0)                                          /* (UDPHS_TST) Speed Configuration Position */
#define UDPHS_TST_SPEED_CFG_Msk               (_UINT32_(0x3) << UDPHS_TST_SPEED_CFG_Pos)           /* (UDPHS_TST) Speed Configuration Mask */
#define UDPHS_TST_SPEED_CFG(value)            (UDPHS_TST_SPEED_CFG_Msk & (_UINT32_(value) << UDPHS_TST_SPEED_CFG_Pos)) /* Assigment of value for SPEED_CFG in the UDPHS_TST register */
#define   UDPHS_TST_SPEED_CFG_NORMAL_Val      _UINT32_(0x0)                                        /* (UDPHS_TST) Normal mode: The macro is in Full Speed mode, ready to make a High Speed identification, if the host supports it and then to automatically switch to High Speed mode.  */
#define   UDPHS_TST_SPEED_CFG_HIGH_SPEED_Val  _UINT32_(0x2)                                        /* (UDPHS_TST) Force High Speed: Set this value to force the hardware to work in High Speed mode. Only for debug or test purpose.  */
#define   UDPHS_TST_SPEED_CFG_FULL_SPEED_Val  _UINT32_(0x3)                                        /* (UDPHS_TST) Force Full Speed: Set this value to force the hardware to work only in Full Speed mode. In this configuration, the macro will not respond to a High Speed reset handshake.  */
#define UDPHS_TST_SPEED_CFG_NORMAL            (UDPHS_TST_SPEED_CFG_NORMAL_Val << UDPHS_TST_SPEED_CFG_Pos) /* (UDPHS_TST) Normal mode: The macro is in Full Speed mode, ready to make a High Speed identification, if the host supports it and then to automatically switch to High Speed mode. Position  */
#define UDPHS_TST_SPEED_CFG_HIGH_SPEED        (UDPHS_TST_SPEED_CFG_HIGH_SPEED_Val << UDPHS_TST_SPEED_CFG_Pos) /* (UDPHS_TST) Force High Speed: Set this value to force the hardware to work in High Speed mode. Only for debug or test purpose. Position  */
#define UDPHS_TST_SPEED_CFG_FULL_SPEED        (UDPHS_TST_SPEED_CFG_FULL_SPEED_Val << UDPHS_TST_SPEED_CFG_Pos) /* (UDPHS_TST) Force Full Speed: Set this value to force the hardware to work only in Full Speed mode. In this configuration, the macro will not respond to a High Speed reset handshake. Position  */
#define UDPHS_TST_TST_J_Pos                   _UINT32_(2)                                          /* (UDPHS_TST) Test J Mode Position */
#define UDPHS_TST_TST_J_Msk                   (_UINT32_(0x1) << UDPHS_TST_TST_J_Pos)               /* (UDPHS_TST) Test J Mode Mask */
#define UDPHS_TST_TST_J(value)                (UDPHS_TST_TST_J_Msk & (_UINT32_(value) << UDPHS_TST_TST_J_Pos)) /* Assigment of value for TST_J in the UDPHS_TST register */
#define UDPHS_TST_TST_K_Pos                   _UINT32_(3)                                          /* (UDPHS_TST) Test K Mode Position */
#define UDPHS_TST_TST_K_Msk                   (_UINT32_(0x1) << UDPHS_TST_TST_K_Pos)               /* (UDPHS_TST) Test K Mode Mask */
#define UDPHS_TST_TST_K(value)                (UDPHS_TST_TST_K_Msk & (_UINT32_(value) << UDPHS_TST_TST_K_Pos)) /* Assigment of value for TST_K in the UDPHS_TST register */
#define UDPHS_TST_TST_PKT_Pos                 _UINT32_(4)                                          /* (UDPHS_TST) Test Packet Mode Position */
#define UDPHS_TST_TST_PKT_Msk                 (_UINT32_(0x1) << UDPHS_TST_TST_PKT_Pos)             /* (UDPHS_TST) Test Packet Mode Mask */
#define UDPHS_TST_TST_PKT(value)              (UDPHS_TST_TST_PKT_Msk & (_UINT32_(value) << UDPHS_TST_TST_PKT_Pos)) /* Assigment of value for TST_PKT in the UDPHS_TST register */
#define UDPHS_TST_OPMODE2_Pos                 _UINT32_(5)                                          /* (UDPHS_TST) OpMode2 Position */
#define UDPHS_TST_OPMODE2_Msk                 (_UINT32_(0x1) << UDPHS_TST_OPMODE2_Pos)             /* (UDPHS_TST) OpMode2 Mask */
#define UDPHS_TST_OPMODE2(value)              (UDPHS_TST_OPMODE2_Msk & (_UINT32_(value) << UDPHS_TST_OPMODE2_Pos)) /* Assigment of value for OPMODE2 in the UDPHS_TST register */
#define UDPHS_TST_Msk                         _UINT32_(0x0000003F)                                 /* (UDPHS_TST) Register Mask  */

#define UDPHS_TST_OPMODE_Pos                  _UINT32_(5)                                          /* (UDPHS_TST Position) OpMode2 */
#define UDPHS_TST_OPMODE_Msk                  (_UINT32_(0x1) << UDPHS_TST_OPMODE_Pos)              /* (UDPHS_TST Mask) OPMODE */
#define UDPHS_TST_OPMODE(value)               (UDPHS_TST_OPMODE_Msk & (_UINT32_(value) << UDPHS_TST_OPMODE_Pos)) 

/* -------- UDPHS_ADDRSIZE : (UDPHS Offset: 0xEC) ( R/ 32) UDPHS IP Address Size Register -------- */
#define UDPHS_ADDRSIZE_ADDRSIZE_Pos           _UINT32_(0)                                          /* (UDPHS_ADDRSIZE) Peripheral Bus Address Size Position */
#define UDPHS_ADDRSIZE_ADDRSIZE_Msk           (_UINT32_(0xFFFFFFFF) << UDPHS_ADDRSIZE_ADDRSIZE_Pos) /* (UDPHS_ADDRSIZE) Peripheral Bus Address Size Mask */
#define UDPHS_ADDRSIZE_ADDRSIZE(value)        (UDPHS_ADDRSIZE_ADDRSIZE_Msk & (_UINT32_(value) << UDPHS_ADDRSIZE_ADDRSIZE_Pos)) /* Assigment of value for ADDRSIZE in the UDPHS_ADDRSIZE register */
#define UDPHS_ADDRSIZE_Msk                    _UINT32_(0xFFFFFFFF)                                 /* (UDPHS_ADDRSIZE) Register Mask  */


/* -------- UDPHS_IPNAME : (UDPHS Offset: 0xF0) ( R/ 32) UDPHS IP Name1 Register -------- */
#define UDPHS_IPNAME_IPNAME_Pos               _UINT32_(0)                                          /* (UDPHS_IPNAME) IP Name in ASCII Format Position */
#define UDPHS_IPNAME_IPNAME_Msk               (_UINT32_(0xFFFFFFFF) << UDPHS_IPNAME_IPNAME_Pos)    /* (UDPHS_IPNAME) IP Name in ASCII Format Mask */
#define UDPHS_IPNAME_IPNAME(value)            (UDPHS_IPNAME_IPNAME_Msk & (_UINT32_(value) << UDPHS_IPNAME_IPNAME_Pos)) /* Assigment of value for IPNAME in the UDPHS_IPNAME register */
#define UDPHS_IPNAME_Msk                      _UINT32_(0xFFFFFFFF)                                 /* (UDPHS_IPNAME) Register Mask  */


/* -------- UDPHS_FEATURES : (UDPHS Offset: 0xF8) ( R/ 32) UDPHS Features Register -------- */
#define UDPHS_FEATURES_Msk                    _UINT32_(0x00000000)                                 /* (UDPHS_FEATURES) Register Mask  */


/** \brief UDPHS register offsets definitions */
#define UDPHS_DMANXTDSC_REG_OFST       _UINT32_(0x00)      /* (UDPHS_DMANXTDSC) UDPHS DMA Next Descriptor Address Register (channel = 0) Offset */
#define UDPHS_DMAADDRESS_REG_OFST      _UINT32_(0x04)      /* (UDPHS_DMAADDRESS) UDPHS DMA Channel Address Register (channel = 0) Offset */
#define UDPHS_DMACONTROL_REG_OFST      _UINT32_(0x08)      /* (UDPHS_DMACONTROL) UDPHS DMA Channel Control Register (channel = 0) Offset */
#define UDPHS_DMASTATUS_REG_OFST       _UINT32_(0x0C)      /* (UDPHS_DMASTATUS) UDPHS DMA Channel Status Register (channel = 0) Offset */
#define UDPHS_EPTCFG_REG_OFST          _UINT32_(0x00)      /* (UDPHS_EPTCFG) UDPHS Endpoint Configuration Register (endpoint = 0) Offset */
#define UDPHS_EPTCTLENB_REG_OFST       _UINT32_(0x04)      /* (UDPHS_EPTCTLENB) UDPHS Endpoint Control Enable Register (endpoint = 0) Offset */
#define UDPHS_EPTCTLDIS_REG_OFST       _UINT32_(0x08)      /* (UDPHS_EPTCTLDIS) UDPHS Endpoint Control Disable Register (endpoint = 0) Offset */
#define UDPHS_EPTCTL_REG_OFST          _UINT32_(0x0C)      /* (UDPHS_EPTCTL) UDPHS Endpoint Control Register (endpoint = 0) Offset */
#define UDPHS_EPTSETSTA_REG_OFST       _UINT32_(0x14)      /* (UDPHS_EPTSETSTA) UDPHS Endpoint Set Status Register (endpoint = 0) Offset */
#define UDPHS_EPTCLRSTA_REG_OFST       _UINT32_(0x18)      /* (UDPHS_EPTCLRSTA) UDPHS Endpoint Clear Status Register (endpoint = 0) Offset */
#define UDPHS_EPTSTA_REG_OFST          _UINT32_(0x1C)      /* (UDPHS_EPTSTA) UDPHS Endpoint Status Register (endpoint = 0) Offset */
#define UDPHS_CTRL_REG_OFST            _UINT32_(0x00)      /* (UDPHS_CTRL) UDPHS Control Register Offset */
#define UDPHS_FNUM_REG_OFST            _UINT32_(0x04)      /* (UDPHS_FNUM) UDPHS Frame Number Register Offset */
#define UDPHS_IEN_REG_OFST             _UINT32_(0x10)      /* (UDPHS_IEN) UDPHS Interrupt Enable Register Offset */
#define UDPHS_INTSTA_REG_OFST          _UINT32_(0x14)      /* (UDPHS_INTSTA) UDPHS Interrupt Status Register Offset */
#define UDPHS_CLRINT_REG_OFST          _UINT32_(0x18)      /* (UDPHS_CLRINT) UDPHS Clear Interrupt Register Offset */
#define UDPHS_EPTRST_REG_OFST          _UINT32_(0x1C)      /* (UDPHS_EPTRST) UDPHS Endpoints Reset Register Offset */
#define UDPHS_TST_REG_OFST             _UINT32_(0xE0)      /* (UDPHS_TST) UDPHS Test Register Offset */
#define UDPHS_ADDRSIZE_REG_OFST        _UINT32_(0xEC)      /* (UDPHS_ADDRSIZE) UDPHS IP Address Size Register Offset */
#define UDPHS_IPNAME_REG_OFST          _UINT32_(0xF0)      /* (UDPHS_IPNAME) UDPHS IP Name1 Register Offset */
#define UDPHS_IPNAME0_REG_OFST         _UINT32_(0xF0)      /* (UDPHS_IPNAME0) UDPHS IP Name1 Register Offset */
#define UDPHS_IPNAME1_REG_OFST         _UINT32_(0xF4)      /* (UDPHS_IPNAME1) UDPHS IP Name1 Register Offset */
#define UDPHS_FEATURES_REG_OFST        _UINT32_(0xF8)      /* (UDPHS_FEATURES) UDPHS Features Register Offset */

