Microchip-MPLAB-Harmony/usb_apps_device/apps/msd_sdcard/firmware/src/packs/ATSAMA5D27CD1G_DFP/component/udphs.h
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief UDPHS_DMA register API structure */
typedef struct
{
  __IO  uint32_t                       UDPHS_DMANXTDSC;    /**< Offset: 0x00 (R/W  32) UDPHS DMA Next Descriptor Address Register (channel = 0) */
  __IO  uint32_t                       UDPHS_DMAADDRESS;   /**< Offset: 0x04 (R/W  32) UDPHS DMA Channel Address Register (channel = 0) */
  __IO  uint32_t                       UDPHS_DMACONTROL;   /**< Offset: 0x08 (R/W  32) UDPHS DMA Channel Control Register (channel = 0) */
  __IO  uint32_t                       UDPHS_DMASTATUS;    /**< Offset: 0x0C (R/W  32) UDPHS DMA Channel Status Register (channel = 0) */
} udphs_dma_registers_t;

/** \brief UDPHS_EPT register API structure */
typedef struct
{
  __IO  uint32_t                       UDPHS_EPTCFG;       /**< Offset: 0x00 (R/W  32) UDPHS Endpoint Configuration Register (endpoint = 0) */
  __O   uint32_t                       UDPHS_EPTCTLENB;    /**< Offset: 0x04 ( /W  32) UDPHS Endpoint Control Enable Register (endpoint = 0) */
  __O   uint32_t                       UDPHS_EPTCTLDIS;    /**< Offset: 0x08 ( /W  32) UDPHS Endpoint Control Disable Register (endpoint = 0) */
  __I   uint32_t                       UDPHS_EPTCTL;       /**< Offset: 0x0C (R/   32) UDPHS Endpoint Control Register (endpoint = 0) */
  __I   uint8_t                        Reserved1[0x04];
  __O   uint32_t                       UDPHS_EPTSETSTA;    /**< Offset: 0x14 ( /W  32) UDPHS Endpoint Set Status Register (endpoint = 0) */
  __O   uint32_t                       UDPHS_EPTCLRSTA;    /**< Offset: 0x18 ( /W  32) UDPHS Endpoint Clear Status Register (endpoint = 0) */
  __I   uint32_t                       UDPHS_EPTSTA;       /**< Offset: 0x1C (R/   32) UDPHS Endpoint Status Register (endpoint = 0) */
} udphs_ept_registers_t;

#define UDPHS_EPT_NUMBER 16

#define UDPHS_DMA_NUMBER 7

/** \brief UDPHS register API structure */
typedef struct
{
  __IO  uint32_t                       UDPHS_CTRL;         /**< Offset: 0x00 (R/W  32) UDPHS Control Register */
  __I   uint32_t                       UDPHS_FNUM;         /**< Offset: 0x04 (R/   32) UDPHS Frame Number Register */
  __I   uint8_t                        Reserved1[0x08];
  __IO  uint32_t                       UDPHS_IEN;          /**< Offset: 0x10 (R/W  32) UDPHS Interrupt Enable Register */
  __I   uint32_t                       UDPHS_INTSTA;       /**< Offset: 0x14 (R/   32) UDPHS Interrupt Status Register */
  __O   uint32_t                       UDPHS_CLRINT;       /**< Offset: 0x18 ( /W  32) UDPHS Clear Interrupt Register */
  __O   uint32_t                       UDPHS_EPTRST;       /**< Offset: 0x1C ( /W  32) UDPHS Endpoints Reset Register */
  __I   uint8_t                        Reserved2[0xC0];
  __IO  uint32_t                       UDPHS_TST;          /**< Offset: 0xE0 (R/W  32) UDPHS Test Register */
  __I   uint8_t                        Reserved3[0x08];
  __I   uint32_t                       UDPHS_ADDRSIZE;     /**< Offset: 0xEC (R/   32) UDPHS IP Address Size Register */
  __I   uint32_t                       UDPHS_IPNAME[2];    /**< Offset: 0xF0 (R/   32) UDPHS IP Name1 Register */
  __I   uint32_t                       UDPHS_FEATURES;     /**< Offset: 0xF8 (R/   32) UDPHS Features Register */
  __I   uint8_t                        Reserved4[0x04];
        udphs_ept_registers_t          UDPHS_EPT[UDPHS_EPT_NUMBER]; /**< Offset: 0x100  */
        udphs_dma_registers_t          UDPHS_DMA[UDPHS_DMA_NUMBER]; /**< Offset: 0x300  */
} udphs_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _SAMA5D_UDPHS_COMPONENT_H_ */
